{
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 10,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 5,
  "image_size": 10,
  "initializer_range": 0.02,
  "intermediate_size": 1,
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 1,
  "num_channels": 3,
  "num_hidden_layers": 1,
  "patch_size": 10,
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.30.2"
}
